来源于10分钟学习pandas，非常经典的教程，使用pandas通常会导入以下包，本环境使用的是python2.7

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

一、创建对象方法

1、通过传递一个list来创建一个Series，pandas会默认创建整型索引

In [2]:
s = pd.Series([5,4,np.nan,3,2,1])

In [3]:
s

0    5.0
1    4.0
2    NaN
3    3.0
4    2.0
5    1.0
dtype: float64

2、传递一个numpy array，时间索引以及标签来创建一个DataFrame

In [4]:
dates = pd.date_range(start='20180821',end='20180826')

In [5]:
dates

DatetimeIndex(['2018-08-21', '2018-08-22', '2018-08-23', '2018-08-24',
               '2018-08-25', '2018-08-26'],
              dtype='datetime64[ns]', freq='D')

In [6]:
dates = pd.date_range(start='20180821',periods=6)

In [7]:
dates

DatetimeIndex(['2018-08-21', '2018-08-22', '2018-08-23', '2018-08-24',
               '2018-08-25', '2018-08-26'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6,4),index = dates ,columns = list('ABCD'))

In [9]:
df

                   A         B         C         D
2018-08-21 -1.547302  0.287078 -0.478303 -0.064753
2018-08-22  0.611372 -0.168405 -0.517242  0.855904
2018-08-23 -1.162544  0.738158  1.070204  0.729696
2018-08-24 -0.610797 -1.388706  0.785773 -0.123466
2018-08-25  1.830246  0.119897 -0.135834 -0.445531
2018-08-26  0.052870 -0.735226 -0.070228 -2.129852

3、可以通过一个字典来创建dataframe，通常以列作为key

In [10]:
df2 = pd.DataFrame({'A':1,'B':'foo','C':np.array([3]*4,dtype='int32')})

In [11]:
df2

   A    B  C
0  1  foo  3
1  1  foo  3
2  1  foo  3
3  1  foo  3

In [12]:
df2.dtypes

A     int64
B    object
C     int32
dtype: object

二、查看数据

1、查看dataframe中头部和尾部的行

In [13]:
df.head()

                   A         B         C         D
2018-08-21 -1.547302  0.287078 -0.478303 -0.064753
2018-08-22  0.611372 -0.168405 -0.517242  0.855904
2018-08-23 -1.162544  0.738158  1.070204  0.729696
2018-08-24 -0.610797 -1.388706  0.785773 -0.123466
2018-08-25  1.830246  0.119897 -0.135834 -0.445531

In [14]:
df.tail(3)

                   A         B         C         D
2018-08-24 -0.610797 -1.388706  0.785773 -0.123466
2018-08-25  1.830246  0.119897 -0.135834 -0.445531
2018-08-26  0.052870 -0.735226 -0.070228 -2.129852

2、查看索引、列和内部的numpy数据：

In [15]:
df.index

DatetimeIndex(['2018-08-21', '2018-08-22', '2018-08-23', '2018-08-24',
               '2018-08-25', '2018-08-26'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [17]:
df.values

array([[-1.54730236,  0.28707849, -0.47830309, -0.06475331],
       [ 0.61137212, -0.16840524, -0.51724196,  0.85590424],
       [-1.16254405,  0.73815792,  1.07020403,  0.72969608],
       [-0.61079666, -1.38870593,  0.78577334, -0.12346578],
       [ 1.83024595,  0.1198965 , -0.13583394, -0.44553142],
       [ 0.05287003, -0.7352264 , -0.07022769, -2.12985214]])

3、describe()函数可对数据快速统计汇总

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.137692 -0.191201  0.109062 -0.196334
std    1.243490  0.764165  0.664997  1.075914
min   -1.547302 -1.388706 -0.517242 -2.129852
25%   -1.024607 -0.593521 -0.392686 -0.365015
50%   -0.278963 -0.024254 -0.103031 -0.094110
75%    0.471747  0.245283  0.571773  0.531084
max    1.830246  0.738158  1.070204  0.855904

4、对数据进行转置

In [19]:
df.T

   2018-08-21  2018-08-22  2018-08-23  2018-08-24  2018-08-25  2018-08-26
A   -1.547302    0.611372   -1.162544   -0.610797    1.830246    0.052870
B    0.287078   -0.168405    0.738158   -1.388706    0.119897   -0.735226
C   -0.478303   -0.517242    1.070204    0.785773   -0.135834   -0.070228
D   -0.064753    0.855904    0.729696   -0.123466   -0.445531   -2.129852

5、对数据按轴排序，行为0，列为1

In [20]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2018-08-21 -0.064753 -0.478303  0.287078 -1.547302
2018-08-22  0.855904 -0.517242 -0.168405  0.611372
2018-08-23  0.729696  1.070204  0.738158 -1.162544
2018-08-24 -0.123466  0.785773 -1.388706 -0.610797
2018-08-25 -0.445531 -0.135834  0.119897  1.830246
2018-08-26 -2.129852 -0.070228 -0.735226  0.052870

In [21]:
df.sort_index(axis=0,ascending=False)

                   A         B         C         D
2018-08-26  0.052870 -0.735226 -0.070228 -2.129852
2018-08-25  1.830246  0.119897 -0.135834 -0.445531
2018-08-24 -0.610797 -1.388706  0.785773 -0.123466
2018-08-23 -1.162544  0.738158  1.070204  0.729696
2018-08-22  0.611372 -0.168405 -0.517242  0.855904
2018-08-21 -1.547302  0.287078 -0.478303 -0.064753

6、按值排序，只能按照列排序

In [22]:
df.sort_values('B',ascending=False)

                   A         B         C         D
2018-08-23 -1.162544  0.738158  1.070204  0.729696
2018-08-21 -1.547302  0.287078 -0.478303 -0.064753
2018-08-25  1.830246  0.119897 -0.135834 -0.445531
2018-08-22  0.611372 -0.168405 -0.517242  0.855904
2018-08-26  0.052870 -0.735226 -0.070228 -2.129852
2018-08-24 -0.610797 -1.388706  0.785773 -0.123466

三、选择

获取数据

1、选择单独的一个列，这将会返回一个Series，等同于df.A

In [23]:
df.A

2018-08-21   -1.547302
2018-08-22    0.611372
2018-08-23   -1.162544
2018-08-24   -0.610797
2018-08-25    1.830246
2018-08-26    0.052870
Freq: D, Name: A, dtype: float64

In [24]:
df['A']

2018-08-21   -1.547302
2018-08-22    0.611372
2018-08-23   -1.162544
2018-08-24   -0.610797
2018-08-25    1.830246
2018-08-26    0.052870
Freq: D, Name: A, dtype: float64

2、通过 [] 选择，默认是对行进行切片，也就是选择行，注意，一个是能取到最后一个元素，一个不能取到最后元素。第一个没有语意，第二个有语意

In [25]:
df[0:3]

                   A         B         C         D
2018-08-21 -1.547302  0.287078 -0.478303 -0.064753
2018-08-22  0.611372 -0.168405 -0.517242  0.855904
2018-08-23 -1.162544  0.738158  1.070204  0.729696

In [26]:
df['20180821':'20180823']

                   A         B         C         D
2018-08-21 -1.547302  0.287078 -0.478303 -0.064753
2018-08-22  0.611372 -0.168405 -0.517242  0.855904
2018-08-23 -1.162544  0.738158  1.070204  0.729696

通过标签选择

1、使用标签来获取一个交叉的区域,dataframe中loc是选行

In [27]:
df.loc[:]

                   A         B         C         D
2018-08-21 -1.547302  0.287078 -0.478303 -0.064753
2018-08-22  0.611372 -0.168405 -0.517242  0.855904
2018-08-23 -1.162544  0.738158  1.070204  0.729696
2018-08-24 -0.610797 -1.388706  0.785773 -0.123466
2018-08-25  1.830246  0.119897 -0.135834 -0.445531
2018-08-26  0.052870 -0.735226 -0.070228 -2.129852

In [28]:
df.loc['20180825']

A    1.830246
B    0.119897
C   -0.135834
D   -0.445531
Name: 2018-08-25 00:00:00, dtype: float64

In [29]:
df.loc[dates[0]]

A   -1.547302
B    0.287078
C   -0.478303
D   -0.064753
Name: 2018-08-21 00:00:00, dtype: float64

2、通过标签来在多个轴上进行选则，非常好用

In [30]:
df.loc[:,['A','B']]

                   A         B
2018-08-21 -1.547302  0.287078
2018-08-22  0.611372 -0.168405
2018-08-23 -1.162544  0.738158
2018-08-24 -0.610797 -1.388706
2018-08-25  1.830246  0.119897
2018-08-26  0.052870 -0.735226

3、标签切片

In [31]:
df.loc['20180821':'20180823',['C','D']]

                   C         D
2018-08-21 -0.478303 -0.064753
2018-08-22 -0.517242  0.855904
2018-08-23  1.070204  0.729696

4、对返回的对象进行维度缩减

In [32]:
df.loc['20180821',['C','D']]

C   -0.478303
D   -0.064753
Name: 2018-08-21 00:00:00, dtype: float64

5、获取一个标量

In [33]:
df.loc[dates[0],'A']

-1.5473023573751077

6、快速访问一个标量

In [34]:
df.at[dates[0],'A']

-1.5473023573751077

通过位置选择

1、通过传递数值进行位置选择（选择的是行）

In [35]:
df.iloc[1]

A    0.611372
B   -0.168405
C   -0.517242
D    0.855904
Name: 2018-08-22 00:00:00, dtype: float64

2、通过数值进行切片，与numpy/python中情况类似

In [36]:
df.iloc[0:2,0:2]

                   A         B
2018-08-21 -1.547302  0.287078
2018-08-22  0.611372 -0.168405

3、通过指定一个位置的列表，与numpy/python中的情况类似

In [37]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2018-08-22  0.611372 -0.517242
2018-08-23 -1.162544  1.070204
2018-08-25  1.830246 -0.135834

4、对行进行切片

In [38]:
df.iloc[1:3,:]

                   A         B         C         D
2018-08-22  0.611372 -0.168405 -0.517242  0.855904
2018-08-23 -1.162544  0.738158  1.070204  0.729696

5、对列进行切片

In [39]:
df.iloc[:,1:3]

                   B         C
2018-08-21  0.287078 -0.478303
2018-08-22 -0.168405 -0.517242
2018-08-23  0.738158  1.070204
2018-08-24 -1.388706  0.785773
2018-08-25  0.119897 -0.135834
2018-08-26 -0.735226 -0.070228

6、获取特定的值

In [40]:
df.iloc[1,1]

-0.16840523578717637

In [41]:
df.iat[1,1]

-0.16840523578717637

布尔索引

1、使用单独的列来选择数据

In [42]:
df[df.A>0]

                   A         B         C         D
2018-08-22  0.611372 -0.168405 -0.517242  0.855904
2018-08-25  1.830246  0.119897 -0.135834 -0.445531
2018-08-26  0.052870 -0.735226 -0.070228 -2.129852

2、使用where操作来选择数据,将所有不满足条件的置为NaN

In [43]:
df[df>0]

                   A         B         C         D
2018-08-21       NaN  0.287078       NaN       NaN
2018-08-22  0.611372       NaN       NaN  0.855904
2018-08-23       NaN  0.738158  1.070204  0.729696
2018-08-24       NaN       NaN  0.785773       NaN
2018-08-25  1.830246  0.119897       NaN       NaN
2018-08-26  0.052870       NaN       NaN       NaN

3、使用isin()来过滤

In [44]:
df2 = df.copy()

In [45]:
df2['E']=['a','b','c','a','b','c']

In [46]:
df2

                   A         B         C         D  E
2018-08-21 -1.547302  0.287078 -0.478303 -0.064753  a
2018-08-22  0.611372 -0.168405 -0.517242  0.855904  b
2018-08-23 -1.162544  0.738158  1.070204  0.729696  c
2018-08-24 -0.610797 -1.388706  0.785773 -0.123466  a
2018-08-25  1.830246  0.119897 -0.135834 -0.445531  b
2018-08-26  0.052870 -0.735226 -0.070228 -2.129852  c

In [47]:
df2[df2['E'].isin(['a','b'])]

                   A         B         C         D  E
2018-08-21 -1.547302  0.287078 -0.478303 -0.064753  a
2018-08-22  0.611372 -0.168405 -0.517242  0.855904  b
2018-08-24 -0.610797 -1.388706  0.785773 -0.123466  a
2018-08-25  1.830246  0.119897 -0.135834 -0.445531  b

设置

1、设置一个新的列，按照行索引来合并

In [48]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range('20180821',periods=6))

In [49]:
df['F'] = s1

In [50]:
df

                   A         B         C         D  F
2018-08-21 -1.547302  0.287078 -0.478303 -0.064753  1
2018-08-22  0.611372 -0.168405 -0.517242  0.855904  2
2018-08-23 -1.162544  0.738158  1.070204  0.729696  3
2018-08-24 -0.610797 -1.388706  0.785773 -0.123466  4
2018-08-25  1.830246  0.119897 -0.135834 -0.445531  5
2018-08-26  0.052870 -0.735226 -0.070228 -2.129852  6

2、通过标签来设置新值

In [51]:
df.at[dates[0],'A']=0

In [52]:
df

                   A         B         C         D  F
2018-08-21  0.000000  0.287078 -0.478303 -0.064753  1
2018-08-22  0.611372 -0.168405 -0.517242  0.855904  2
2018-08-23 -1.162544  0.738158  1.070204  0.729696  3
2018-08-24 -0.610797 -1.388706  0.785773 -0.123466  4
2018-08-25  1.830246  0.119897 -0.135834 -0.445531  5
2018-08-26  0.052870 -0.735226 -0.070228 -2.129852  6

3、通过位置设置新值

In [53]:
df.at[dates[0],'A']=1.0

In [54]:
df

                   A         B         C         D  F
2018-08-21  1.000000  0.287078 -0.478303 -0.064753  1
2018-08-22  0.611372 -0.168405 -0.517242  0.855904  2
2018-08-23 -1.162544  0.738158  1.070204  0.729696  3
2018-08-24 -0.610797 -1.388706  0.785773 -0.123466  4
2018-08-25  1.830246  0.119897 -0.135834 -0.445531  5
2018-08-26  0.052870 -0.735226 -0.070228 -2.129852  6

In [55]:
df.iat[0,1]=0

In [56]:
df

                   A         B         C         D  F
2018-08-21  1.000000  0.000000 -0.478303 -0.064753  1
2018-08-22  0.611372 -0.168405 -0.517242  0.855904  2
2018-08-23 -1.162544  0.738158  1.070204  0.729696  3
2018-08-24 -0.610797 -1.388706  0.785773 -0.123466  4
2018-08-25  1.830246  0.119897 -0.135834 -0.445531  5
2018-08-26  0.052870 -0.735226 -0.070228 -2.129852  6

4、通过numpy数值设置一组新值

In [57]:
df.loc[:,'D'] = np.array([5]*len(df))

In [58]:
df

                   A         B         C  D  F
2018-08-21  1.000000  0.000000 -0.478303  5  1
2018-08-22  0.611372 -0.168405 -0.517242  5  2
2018-08-23 -1.162544  0.738158  1.070204  5  3
2018-08-24 -0.610797 -1.388706  0.785773  5  4
2018-08-25  1.830246  0.119897 -0.135834  5  5
2018-08-26  0.052870 -0.735226 -0.070228  5  6

5、通过where条件来设置新值

In [59]:
df2 = df.copy()

In [60]:
df2[df2>0] = -df2

In [61]:
df2

                   A         B         C  D  F
2018-08-21 -1.000000  0.000000 -0.478303 -5 -1
2018-08-22 -0.611372 -0.168405 -0.517242 -5 -2
2018-08-23 -1.162544 -0.738158 -1.070204 -5 -3
2018-08-24 -0.610797 -1.388706 -0.785773 -5 -4
2018-08-25 -1.830246 -0.119897 -0.135834 -5 -5
2018-08-26 -0.052870 -0.735226 -0.070228 -5 -6

In [62]:
-df2

                   A         B         C    D    F
2018-08-21  1.000000 -0.000000  0.478303  5.0  1.0
2018-08-22  0.611372  0.168405  0.517242  5.0  2.0
2018-08-23  1.162544  0.738158  1.070204  5.0  3.0
2018-08-24  0.610797  1.388706  0.785773  5.0  4.0
2018-08-25  1.830246  0.119897  0.135834  5.0  5.0
2018-08-26  0.052870  0.735226  0.070228  5.0  6.0

四、缺失值处理

在pandas中，使用np.nan来替代缺失值，这些值将默认不会包含在计算中

In [63]:
df.iat[0,2]=np.nan

In [64]:
df

                   A         B         C  D  F
2018-08-21  1.000000  0.000000       NaN  5  1
2018-08-22  0.611372 -0.168405 -0.517242  5  2
2018-08-23 -1.162544  0.738158  1.070204  5  3
2018-08-24 -0.610797 -1.388706  0.785773  5  4
2018-08-25  1.830246  0.119897 -0.135834  5  5
2018-08-26  0.052870 -0.735226 -0.070228  5  6

1、reindex()方法可以对指定轴上的索引进行改变/增加/删除操作，并返回原始数据的一个拷贝

In [65]:
df1 = df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])

In [66]:
df1.loc[dates[0]:dates[2],'E']=1

In [67]:
df1

                   A         B         C  D  F    E
2018-08-21  1.000000  0.000000       NaN  5  1  1.0
2018-08-22  0.611372 -0.168405 -0.517242  5  2  1.0
2018-08-23 -1.162544  0.738158  1.070204  5  3  1.0
2018-08-24 -0.610797 -1.388706  0.785773  5  4  NaN

2、去掉包含缺失值的行

In [68]:
df1.dropna(how='any')

                   A         B         C  D  F    E
2018-08-22  0.611372 -0.168405 -0.517242  5  2  1.0
2018-08-23 -1.162544  0.738158  1.070204  5  3  1.0

3、对缺失值进行填充

In [69]:
df1.fillna(value=5)

                   A         B         C  D  F    E
2018-08-21  1.000000  0.000000  5.000000  5  1  1.0
2018-08-22  0.611372 -0.168405 -0.517242  5  2  1.0
2018-08-23 -1.162544  0.738158  1.070204  5  3  1.0
2018-08-24 -0.610797 -1.388706  0.785773  5  4  5.0

4、对数据进行布尔填充

In [70]:
pd.isnull(df1)

                A      B      C      D      F      E
2018-08-21  False  False   True  False  False  False
2018-08-22  False  False  False  False  False  False
2018-08-23  False  False  False  False  False  False
2018-08-24  False  False  False  False  False   True

五、相关操作

1、执行描述性统计，默认按列统计

In [71]:
df.mean()

A    0.286858
B   -0.239047
C    0.226535
D    5.000000
F    3.500000
dtype: float64

2、在其他轴上统计

In [72]:
df.mean(axis=1)

2018-08-21    1.750000
2018-08-22    1.385145
2018-08-23    1.729164
2018-08-24    1.557254
2018-08-25    2.362862
2018-08-26    2.049483
Freq: D, dtype: float64

3、对于拥有不同维度，需要对齐的对象进行操作，pandas会自动的沿着指定的维度进行广播

In [73]:
dates

DatetimeIndex(['2018-08-21', '2018-08-22', '2018-08-23', '2018-08-24',
               '2018-08-25', '2018-08-26'],
              dtype='datetime64[ns]', freq='D')

In [74]:
s = pd.Series([1,2,3,np.nan,5,6],index=dates).shift(2)

In [75]:
s

2018-08-21    NaN
2018-08-22    NaN
2018-08-23    1.0
2018-08-24    2.0
2018-08-25    3.0
2018-08-26    NaN
Freq: D, dtype: float64

Apply

1、对数据应用函数，默认是对列操作

In [76]:
df

                   A         B         C  D  F
2018-08-21  1.000000  0.000000       NaN  5  1
2018-08-22  0.611372 -0.168405 -0.517242  5  2
2018-08-23 -1.162544  0.738158  1.070204  5  3
2018-08-24 -0.610797 -1.388706  0.785773  5  4
2018-08-25  1.830246  0.119897 -0.135834  5  5
2018-08-26  0.052870 -0.735226 -0.070228  5  6

In [77]:
df.apply(np.cumsum)

                   A         B         C   D   F
2018-08-21  1.000000  0.000000       NaN   5   1
2018-08-22  1.611372 -0.168405 -0.517242  10   3
2018-08-23  0.448828  0.569753  0.552962  15   6
2018-08-24 -0.161969 -0.818953  1.338735  20  10
2018-08-25  1.668277 -0.699057  1.202901  25  15
2018-08-26  1.721147 -1.434283  1.132674  30  21

In [78]:
df.apply(lambda x: x.max()-x.min())

A    2.992790
B    2.126864
C    1.587446
D    0.000000
F    5.000000
dtype: float64

直方图

In [79]:
s = pd.Series(np.random.randint(0,7,size=10))

In [80]:
s

0    2
1    4
2    3
3    3
4    1
5    6
6    5
7    6
8    2
9    3
dtype: int64

In [81]:
s.value_counts()

3    3
6    2
2    2
5    1
4    1
1    1
dtype: int64

字符串方法，Series对象在其str属性中包含大量字符串处理方法，可以很容易应用到数组中的每一个元素

In [82]:
s = pd.Series(['A','B',np.nan,'cat','Aaba'])

In [83]:
s.str.lower()

0       a
1       b
2     NaN
3     cat
4    aaba
dtype: object

六、合并

pandas提供大量的方法能够轻松对Series，DataFrame和Panel对象进行各种符号逻辑关系的合并操作

In [84]:
df = pd.DataFrame(np.random.randn(10,4))

In [85]:
df

          0         1         2         3
0  0.280608 -1.213374 -0.662463  0.167437
1  0.073648 -0.415781 -0.120992  0.618445
2 -0.742053  0.190680  0.975366 -2.147191
3 -0.928823 -0.889689 -0.439045 -0.629750
4  0.799082  0.431088 -0.597032 -0.511543
5  2.481650  0.066065 -0.631332 -0.869345
6  0.505484  0.428729 -0.482920  1.761757
7 -1.650993 -0.531216 -0.800232 -0.690201
8  0.427680 -0.706549 -0.928562 -0.784688
9 -0.579767  0.432759  1.013713 -0.890188

In [86]:
pieces = [df[:3],df[3:7],df[7:]]

In [87]:
pieces

[          0         1         2         3
 0  0.280608 -1.213374 -0.662463  0.167437
 1  0.073648 -0.415781 -0.120992  0.618445
 2 -0.742053  0.190680  0.975366 -2.147191,
           0         1         2         3
 3 -0.928823 -0.889689 -0.439045 -0.629750
 4  0.799082  0.431088 -0.597032 -0.511543
 5  2.481650  0.066065 -0.631332 -0.869345
 6  0.505484  0.428729 -0.482920  1.761757,
           0         1         2         3
 7 -1.650993 -0.531216 -0.800232 -0.690201
 8  0.427680 -0.706549 -0.928562 -0.784688
 9 -0.579767  0.432759  1.013713 -0.890188]

In [88]:
pd.concat(pieces)

          0         1         2         3
0  0.280608 -1.213374 -0.662463  0.167437
1  0.073648 -0.415781 -0.120992  0.618445
2 -0.742053  0.190680  0.975366 -2.147191
3 -0.928823 -0.889689 -0.439045 -0.629750
4  0.799082  0.431088 -0.597032 -0.511543
5  2.481650  0.066065 -0.631332 -0.869345
6  0.505484  0.428729 -0.482920  1.761757
7 -1.650993 -0.531216 -0.800232 -0.690201
8  0.427680 -0.706549 -0.928562 -0.784688
9 -0.579767  0.432759  1.013713 -0.890188